con.txt

<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:C2BPaymentConfirmationRequest xmlns:ns1="http://cps.huawei.com/cpsinterface/c2bpayment"><TransType>Pay Bill</TransType><TransID>LH29QVKLZL</TransID><TransTime>20170802021510</TransTime><TransAmount>10.00</TransAmount><BusinessShortCode>827136</BusinessShortCode><BillRefNumber>test</BillRefNumber><OrgAccountBalance>100.00</OrgAccountBalance><MSISDN>254722912908</MSISDN><KYCInfo><KYCName>[Personal Details][First Name]</KYCName><KYCValue>ABUGA</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Middle Name]</KYCName><KYCValue>J</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Last Name]</KYCName><KYCValue>BICHANG&apos;A</KYCValue></KYCInfo></ns1:C2BPaymentConfirmationRequest></soapenv:Body></soapenv:Envelope>
-------------------------------------------------------------------------------------------
<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:C2BPaymentConfirmationRequest xmlns:ns1="http://cps.huawei.com/cpsinterface/c2bpayment"><TransType>Pay Bill</TransType><TransID>LGS5P9BRJJ</TransID><TransTime>20170728152655</TransTime><TransAmount>50.00</TransAmount><BusinessShortCode>827136</BusinessShortCode><BillRefNumber>test</BillRefNumber><OrgAccountBalance>100.00</OrgAccountBalance><MSISDN>254722912908</MSISDN><KYCInfo><KYCName>[Personal Details][First Name]</KYCName><KYCValue>ABUGA</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Middle Name]</KYCName><KYCValue>J</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Last Name]</KYCName><KYCValue>BICHANG&apos;A</KYCValue></KYCInfo></ns1:C2BPaymentConfirmationRequest></soapenv:Body></soapenv:Envelope>
-------------------------------------------------------------------------------------------
<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:C2BPaymentConfirmationRequest xmlns:ns1="http://cps.huawei.com/cpsinterface/c2bpayment"><TransType>Pay Bill</TransType><TransID>LGS5P9BRJJ</TransID><TransTime>20170728152655</TransTime><TransAmount>50.00</TransAmount><BusinessShortCode>827136</BusinessShortCode><BillRefNumber>test</BillRefNumber><OrgAccountBalance>100.00</OrgAccountBalance><MSISDN>254722912908</MSISDN><KYCInfo><KYCName>[Personal Details][First Name]</KYCName><KYCValue>ABUGA</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Middle Name]</KYCName><KYCValue>J</KYCValue></KYCInfo><KYCInfo><KYCName>[Personal Details][Last Name]</KYCName><KYCValue>BICHANG&apos;A</KYCValue></KYCInfo></ns1:C2BPaymentConfirmationRequest></soapenv:Body></soapenv:Envelope>
-------------------------------------------------------------------------------------------
